results/data/run3/jvm-static/erik-laptop/quarkus-io-thread-10000-MEASURE.wrk2.out
Running 1m test @ http://erik-pc.local:8080/greeting/Bob
  4 threads and 100 connections
  Thread calibration: mean lat.: 1.286ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.194ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.242ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.255ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.25ms  520.08us   3.83ms   63.24%
    Req/Sec     2.64k   378.97     4.22k    82.38%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.22ms
 75.000%    1.62ms
 90.000%    1.97ms
 99.000%    2.46ms
 99.900%    2.86ms
 99.990%    3.19ms
 99.999%    3.44ms
100.000%    3.83ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.194     0.000000            1         1.00
       0.590     0.100000        50098         1.11
       0.737     0.200000        99894         1.25
       0.888     0.300000       149723         1.43
       1.054     0.400000       199632         1.67
       1.219     0.500000       249506         2.00
       1.301     0.550000       274579         2.22
       1.382     0.600000       299529         2.50
       1.460     0.650000       324290         2.86
       1.536     0.700000       349140         3.33
       1.618     0.750000       374128         4.00
       1.665     0.775000       386598         4.44
       1.715     0.800000       399241         5.00
       1.768     0.825000       411556         5.71
       1.827     0.850000       424030         6.67
       1.894     0.875000       436418         8.00
       1.932     0.887500       442654         8.89
       1.972     0.900000       448948        10.00
       2.015     0.912500       455237        11.43
       2.061     0.925000       461448        13.33
       2.111     0.937500       467606        16.00
       2.139     0.943750       470789        17.78
       2.169     0.950000       473954        20.00
       2.197     0.956250       476940        22.86
       2.231     0.962500       480195        26.67
       2.267     0.968750       483324        32.00
       2.285     0.971875       484796        35.56
       2.305     0.975000       486312        40.00
       2.329     0.978125       487911        45.71
       2.355     0.981250       489448        53.33
       2.387     0.984375       490996        64.00
       2.405     0.985938       491798        71.11
       2.425     0.987500       492560        80.00
       2.447     0.989062       493326        91.43
       2.473     0.990625       494113       106.67
       2.503     0.992188       494877       128.00
       2.521     0.992969       495279       142.22
       2.539     0.993750       495639       160.00
       2.561     0.994531       496022       182.86
       2.589     0.995313       496442       213.33
       2.617     0.996094       496817       256.00
       2.635     0.996484       497007       284.44
       2.661     0.996875       497204       320.00
       2.687     0.997266       497395       365.71
       2.715     0.997656       497586       426.67
       2.745     0.998047       497777       512.00
       2.761     0.998242       497877       568.89
       2.785     0.998437       497973       640.00
       2.809     0.998633       498067       731.43
       2.835     0.998828       498169       853.33
       2.865     0.999023       498263      1024.00
       2.877     0.999121       498315      1137.78
       2.897     0.999219       498363      1280.00
       2.917     0.999316       498410      1462.86
       2.937     0.999414       498460      1706.67
       2.969     0.999512       498508      2048.00
       2.979     0.999561       498531      2275.56
       2.995     0.999609       498557      2560.00
       3.013     0.999658       498578      2925.71
       3.041     0.999707       498603      3413.33
       3.081     0.999756       498630      4096.00
       3.093     0.999780       498639      4551.11
       3.115     0.999805       498652      5120.00
       3.135     0.999829       498663      5851.43
       3.149     0.999854       498675      6826.67
       3.171     0.999878       498688      8192.00
       3.181     0.999890       498694      9102.22
       3.197     0.999902       498701     10240.00
       3.207     0.999915       498706     11702.86
       3.221     0.999927       498712     13653.33
       3.231     0.999939       498718     16384.00
       3.239     0.999945       498721     18204.44
       3.249     0.999951       498726     20480.00
       3.277     0.999957       498727     23405.71
       3.297     0.999963       498730     27306.67
       3.307     0.999969       498733     32768.00
       3.337     0.999973       498736     36408.89
       3.337     0.999976       498736     40960.00
       3.347     0.999979       498738     46811.43
       3.351     0.999982       498739     54613.33
       3.383     0.999985       498741     65536.00
       3.429     0.999986       498742     72817.78
       3.429     0.999988       498742     81920.00
       3.445     0.999989       498743     93622.86
       3.535     0.999991       498744    109226.67
       3.667     0.999992       498745    131072.00
       3.667     0.999993       498745    145635.56
       3.667     0.999994       498745    163840.00
       3.697     0.999995       498747    187245.71
       3.697     0.999995       498747    218453.33
       3.697     0.999996       498747    262144.00
       3.697     0.999997       498747    291271.11
       3.697     0.999997       498747    327680.00
       3.697     0.999997       498747    374491.43
       3.697     0.999998       498747    436906.67
       3.829     0.999998       498748    524288.00
       3.829     1.000000       498748          inf
#[Mean    =        1.250, StdDeviation   =        0.520]
#[Max     =        3.828, Total count    =       498748]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  599440 requests in 1.00m, 41.73MB read
Requests/sec:   9990.35
Transfer/sec:    712.20KB